DataProcessors/ЗагрузкаСвечей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаСвечей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Таймфрейм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТаймфреймыСвечей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантИсточникаИнструментов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИсточникаИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗагрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыЗагрузкиСвечей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокИнструментов</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПровайдерДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ЗагрузкаСвечей/Ext/ObjectModule.bsl
&НаСервере
Функция ВыполнитьЗагрузку() Экспорт
    
    ПараметрыЗагрузки = Новый Структура;
    ПараметрыЗагрузки.Вставить("Таймфрейм", Таймфрейм);
    ПараметрыЗагрузки.Вставить("ВариантИсточникаИнструментов", ВариантИсточникаИнструментов);
    ПараметрыЗагрузки.Вставить("РежимЗагрузки", РежимЗагрузки);
    ПараметрыЗагрузки.Вставить("ДатаНачала", Период.ДатаНачала);
    ПараметрыЗагрузки.Вставить("ДатаОкончания", Период.ДатаОкончания);
	//ПараметрыЗагрузки.Вставить("Платформа", Платформа);
	//ПараметрыЗагрузки.Вставить("Счет", Счет);
    ПараметрыЗагрузки.Вставить("СписокИнструментов", СписокИнструментов);
    
    Возврат СвечиСервис.ЗагрузитьСвечи(ПараметрыЗагрузки);
    
КонецФункции
